#+TODO: TODO IN-PROGRESS WAITING DONE
#+STARTUP: latexpreview
#+INFOJS_OPT: view:info toc:4
#+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
#+OPTIONS: tex:t num:nil
#+PROPERTY: header-args:bash :exports both  
#+LATEX_HEADER: \usepackage{/home/ryan/Dropbox/profiles/Templates/LaTeX/ScreenStyle}
#+CSL_STYLE: /home/ryan/.emacs.d/elpa/citeproc-org-0.2.2/styles/Nature.csl
#+TITLE: Synchronising DotFiles


In order to synchronise =DotFiles= it is necessary to:

1. backup existing =DotFiles= to a new directory
   1. This should be done as a script to it's reproducible. 
2. Link the files between the directories
   1. This should be undo-able so ideally with =GNU Stow=
3. synchronise that directory between devices
   1. **VCS** repo (e.g. =git=/=bzr= with =GitHub=)
   2. and/or Cloud 

There is nothing more to managing =DotFiles=.

*** 1. Backup Existing Dotfiles to a new Directory
 In order to backup existing dotfiles to a new directory, just use =cp= with =--parents= option.

 In order to not get =.git= files as well we can use extended globbing[fn:4] (because trying to exclude the with =find ~/ -not -name \*\.git\* -exec cp {} --parents ;\= is a PITA and removing them after the fact with =find ./HomeDir -not -name \*\.git\* -exec rm-rvf {} +=  isn't really a good idea:

 #+BEGIN_SRC bash
     CopyinFiles() {
         for dotfiles in $@; do
             if [ -e $dotfiles ]; then
                 cp -lr --parents $dotfiles ./
             fi
         done
     }

 #    CopyinFiles ~/.bashrc ~/.profile ~/.config/autostart/ ~/.zshrc ~/.zprofile ~/.oh-my-zsh/ ~/config/fish ~/.config/omf/ ~/.inputrc 
 CopyinFiles \
     ~/.bashrc            \
     ~/.profile           \
     ~/.config/autostart  \
     ~/.zshrc             \
     ~/.zprofile          \
     ~/.oh-my-zsh         \
     ~/.config/fish       \
     ~/.config/omf*       \
     ~/.inputrc           \
     ~/.config/i3         \
     ~/.conky*            \
     ~/.config/nvim/init.vim       \
     ~/.config/systemd    \
     ~/.systemd           \
     ~/.spacemacs         \
     ~/.config/ranger     \
     ~/.emacs.d/          \
     ~/bin                \
     ~/.xmodmap           #END

 if [ -d ./home ]; then
     rsync -av ./home/$(basename $HOME)/ ./HomeDir &> /dev/null
     rm -r ./home;
 else
     echo "it doesn't look like anything was copied";
 fi

   find ./HomeDir/ -maxdepth 1 -type d 
   echo Success!
 #+END_SRC

 #+RESULTS:
 | ./HomeDir/           |
 | ./HomeDir/.oh-my-zsh |
 | ./HomeDir/.emacs.d   |
 | ./HomeDir/.config    |
 | ./HomeDir/bin        |
 | Success!             |

 So what this does is first test to see if the file exists using an if test, this prevents =cp= throwing a warning, then it copies the file including the parent folder strucutre.
 Finally it moves the home directory to =HomeDir= removes the root directory structure, the assumption being only local =DotFiles= desire to be synced.

**** 1(a) Remove =.git= Directories
 In syncing the =~/.emacs.d= directory , if we didn't use extended globbing, we are going to have the =.git= folder in there as well which we don't really want, so we'll just remove it, please don't run this from =~= or =/=, it might cause a mess, that's a part of the reason for renaming your home directory to HomeDir, it's just to be sure, make sure you're in a subdirectory like =~/Dropbox/.DotFiles=.

 #+BEGIN_SRC bash
 find ./HomeDir -name \*\.git\* 
      find ./HomeDir/ -name \*\.git\* -exec rm -rf {} \;
      find ./HomeDir/ -name \*\.git\* -exec rm -rf {} \;
 #+END_SRC

 #+RESULTS:
 : ./HomeDir/.config/autostart/.gitignore

